Конфигурация/Catalogs/Доверенности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Доверенности</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоверенности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоверенностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доверитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоПредоставления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтзыва</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеПолномочий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственноеЛицоПо5511У</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственноеЛицоПо5899У</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписаниеЛюбыхДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписаниеДоговоровДУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписаниеУведомленийОВводеВыводе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписаниеАктовПриемаПередачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписаниеПростыхПисем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписаниеБухгалтерскихДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписаниеОтчетности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаверениеКопийДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредоставлениеДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОграничений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаПредоставления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыПредоставленияДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДоверенности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформационнаяСистема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОграниченияПоВидамДоговоров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДоговора</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Поверенные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поверенный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/InformationRegisters/СтатусыМЧД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтатусыМЧД</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыМашиночитаемойДоверенностиВРеестреФНС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УстановленВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Доверенность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Доверенности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ФормыПредоставленияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ФормыПредоставленияДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оригинал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КопияНотариальная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КопияЗавереннаяОрганизацией</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КопияЗавереннаяЭП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МЧД</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/СтатусыМашиночитаемойДоверенностиВРеестреФНС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СтатусыМашиночитаемойДоверенностиВРеестреФНС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зарегистрировано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отозвано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИстекСрокДействия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаНачалаДействияНеНаступила</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Catalogs/Доверенности/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.ЭтоПолноправныйПользователь = РаботаСПользователями.ЭтоПолноправныйПользователь();
	
	Если ПравоДоступа("Редактирование", Метаданные.Справочники.Доверенности) Тогда
	
		Если Не (РольДоступна("ПравовоеУправление") Или Объект.ВидДоверенности = Перечисления.ВидыДоверенностей.Исходящая) Тогда
			
			// Входящие доверенности могут редактировать только пользователи с ролью ПравовоеУправление
			// Для прочих ролей на изменение и добавлени настроено ограничение в РЛС
			Если Объект.Ссылка.Пустая() Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У пользователя недостаточно прав на исполнение операции над базой данных",,,, Отказ);
				Возврат;
				
			Иначе	
				
				ЭтаФорма.ТолькоПросмотр = Истина;
				
			КонецЕсли; 
		
		КонецЕсли; 
	
	КонецЕсли; 
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры // ПриСозданииНаСервере

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ПроверитьРеквизитОбъектаПоФлагу("ДоверенностьОтозвана", "ДатаОтзыва", "Дата отзыва", Отказ);
	
	Если Объект.ВидДоверенности = Перечисления.ВидыДоверенностей.Входящая Тогда 
		ПроверитьРеквизитОбъектаПоФлагу("ИныеПолномочия", "ОписаниеПолномочий", "Иные полномочия", Отказ);
		ПроверитьРеквизитОбъектаПоФлагу("Ограничения", "ОписаниеОграничений", "Ограничения", Отказ);
		ПроверитьРеквизитОбъектаПоФлагу("ОграниченияПоВидамДоговоров", "ОграниченияПоВидамДоговоров", "Виды договоров", Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ЭтаФорма.ДоверенностьОтозвана Тогда
		Объект.ДатаОтзыва = Неопределено;
	КонецЕсли; 
	
	Если Не ЭтаФорма.ИныеПолномочия Тогда
		Объект.ОписаниеПолномочий = Неопределено;
	КонецЕсли;
	
	Объект.Поверенные.Очистить();
	
	Для каждого Поверенный Из ЭтаФорма.СписокПоверенных Цикл
	
		НоваяСтрока = Объект.Поверенные.Добавить();
		НоваяСтрока.Поверенный = Поверенный.Значение;
		
		Если ЭтаФорма.НесколькоПоверенных = 0 Тогда
			Прервать;
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЭтаФорма.ИсходнаяДатаДокумента = ТекущийОбъект.Дата;
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти 

#Область Обработчики_событий_элементов_формы

&НаКлиенте
Процедура ВидДоверенностиПриИзменении(Элемент)
	
	ОбновитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ИныеПолномочияПриИзменении(Элемент)
	
	Элементы.ОписаниеПолномочий.Видимость = ЭтаФорма.ИныеПолномочия; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОграниченияФлагПриИзменении(Элемент)
	
	Элементы.ОписаниеОграничений.Видимость = ЭтаФорма.Ограничения; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОграниченияПоВидамДоговоровПриИзменении(Элемент)
	
	Элементы.ВидыДоговоров.Видимость = ЭтаФорма.ОграниченияПоВидамДоговоров;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоверенностьОтозванаПриИзменении(Элемент)
	
	Элементы.ДатаОтзыва.Видимость = ЭтаФорма.ДоверенностьОтозвана;
	
КонецПроцедуры

&НаКлиенте
Процедура НесколькоПоверенныхПриИзменении(Элемент)
	
	Если ЭтаФорма.НесколькоПоверенных = 0 Тогда
		
		Элементы.Поверенный.Видимость = Истина;
		Элементы.СписокПоверенных.Видимость = Ложь;
		
		Если ЭтаФорма.СписокПоверенных.Количество() = 0 Тогда
			// добавим пустой элемент в список
			ЭтаФорма.СписокПоверенных.Добавить();
		КонецЕсли;
		
	Иначе
		
		Элементы.Поверенный.Видимость = Ложь;
		Элементы.СписокПоверенных.Видимость = Истина;
		
		Если ЭтаФорма.СписокПоверенных.Количество() > 0 И Не ЗначениеЗаполнено(ЭтаФорма.СписокПоверенных[0].Значение) Тогда
			// если поверенный не был задан - удалим пустой элемент
			ЭтаФорма.СписокПоверенных.Удалить(0);
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПоверенныхПриИзменении(Элемент)
	
	// удалим строки с пустыми значениями
	Индекс = ЭтаФорма.СписокПоверенных.Количество() - 1;
	Пока Индекс >= 0 Цикл
	
		Если Не ЗначениеЗаполнено(ЭтаФорма.СписокПоверенных[Индекс].Значение) Тогда
			ЭтаФорма.СписокПоверенных.Удалить(Индекс);
		КонецЕсли; 
		Индекс = Индекс - 1;
	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если Объект.ВидДоверенности = ПредопределенноеЗначение("Перечисление.ВидыДоверенностей.Исходящая") 
		И Объект.Дата <> ЭтаФорма.ИсходнаяДатаДокумента Тогда
		Объект.Номер = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаПредоставленияПриИзменении(Элемент)
	
	ЭтаФорма.ЭтоМЧД = Объект.ФормаПредоставления = ПредопределенноеЗначение("Перечисление.ФормыПредоставленияДокументов.МЧД");
	
	Если Не ЗначениеЗаполнено(Объект.МестоХранения) И ЭтоМЧД Тогда
		Объект.МестоХранения = "Бэк-офис";
	КонецЕсли;
	
	НастроитьФормуМЧД(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти 

#Область Служебные_процедуры_и_функции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	ЭтаФорма.ИсходнаяДатаДокумента = Объект.Дата;
	ЭтаФорма.ЭтоМЧД = (Объект.ФормаПредоставления = Перечисления.ФормыПредоставленияДокументов.МЧД);
	ЭтаФорма.ДоверенностьОтозвана = ЗначениеЗаполнено(Объект.ДатаОтзыва);
	ЭтаФорма.ИныеПолномочия = ЗначениеЗаполнено(Объект.ОписаниеПолномочий);
	ЭтаФорма.Ограничения = ЗначениеЗаполнено(Объект.ОписаниеОграничений);
	ЭтаФорма.ОграниченияПоВидамДоговоров = ЗначениеЗаполнено(Объект.ОграниченияПоВидамДоговоров);
	ЭтаФорма.СписокПоверенных.ЗагрузитьЗначения(Объект.Поверенные.Выгрузить(, "Поверенный").ВыгрузитьКолонку(0));

	КоличествоПоверенных = ЭтаФорма.СписокПоверенных.Количество();
	Если КоличествоПоверенных > 1 Тогда
		ЭтаФорма.НесколькоПоверенных = 1;
	Иначе
		ЭтаФорма.НесколькоПоверенных = 0;
		Если КоличествоПоверенных = 0 Тогда
			ЭтаФорма.СписокПоверенных.Добавить();
		КонецЕсли; 
	КонецЕсли;
	
	ОбновитьВидимостьДоступность(ЭтаФорма);
	
	Если ЭтаФорма.ЭтоМЧД И Не Объект.Ссылка.Пустая() И Объект.ВидДоверенности = Перечисления.ВидыДоверенностей.Входящая Тогда
		ТекущийСтатус = ПолучитьТекущийСтатус(Объект.Организация, Объект.Ссылка);
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ТекущийСтатус);
		Элементы.СтатусВРеестреФНС.ЦветТекста = ТекущийСтатус.Цвет;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекущийСтатус(Организация, Доверенность)

	ТекущийСтатус = НовыйТекущийСтатус();
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтатусыМЧДСрезПоследних.Период КАК Период,
		|	СтатусыМЧДСрезПоследних.Статус КАК Статус,
		|	СтатусыМЧДСрезПоследних.УстановленВручную КАК УстановленВручную,
		|	СтатусыМЧДСрезПоследних.Комментарий КАК Комментарий
		|ИЗ
		|	РегистрСведений.СтатусыМЧД.СрезПоследних(
		|			,
		|			Организация = &Организация
		|				И Доверенность = &Доверенность) КАК СтатусыМЧДСрезПоследних";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Доверенность", Доверенность);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если ЗначениеЗаполнено(Выборка.Статус) Тогда
			ТекущийСтатус.СтатусВРеестреФНС = Строка(Выборка.Статус) + ?(Выборка.УстановленВручную, " (Установлен вручную)", "");
		КонецЕсли;
		
		ТекущийСтатус.ДатаПроверкиСтатуса = Выборка.Период;
		
		Если Не Выборка.УстановленВручную 
			И (Выборка.Статус = Перечисления.СтатусыМашиночитаемойДоверенностиВРеестреФНС.Зарегистрировано 
				Или Выборка.Статус = Перечисления.СтатусыМашиночитаемойДоверенностиВРеестреФНС.ДатаНачалаДействияНеНаступила) Тогда
			ТекущийСтатус.Цвет = Новый Цвет;
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат ТекущийСтатус;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьВидимостьДоступность(ЭтаФорма)

	Если ЗначениеЗаполнено(ЭтаФорма.Объект.ВидДоверенности) Тогда
	
		ЭтоВходящаяДоверенность = (ЭтаФорма.Объект.ВидДоверенности = ПредопределенноеЗначение("Перечисление.ВидыДоверенностей.Входящая"));
		
		ЭтаФорма.Элементы.Доверитель.Видимость = ЭтоВходящаяДоверенность;
		
		ЭтаФорма.Элементы.МестоПредоставления.Видимость = Не ЭтоВходящаяДоверенность;
		ЭтаФорма.Элементы.ГруппаФормаПредоставленияМестоХранения.Видимость = ЭтоВходящаяДоверенность;
		ЭтаФорма.Элементы.ГруппаВидыДоговоров.Видимость = ЭтоВходящаяДоверенность;
		ЭтаФорма.Элементы.ГруппаОтветственноеЛицо.Видимость = Не ЭтоВходящаяДоверенность;
		ЭтаФорма.Элементы.ЭтоМЧД.Видимость = Не ЭтоВходящаяДоверенность;
		
		Если ЭтоВходящаяДоверенность Тогда
			ЭтаФорма.Элементы.Номер.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.НеОтображать;
			ЭтаФорма.Элементы.Номер.АвтоОтметкаНезаполненного = Истина;
			ЭтаФорма.Элементы.Доверитель.АвтоОтметкаНезаполненного = Истина;
		Иначе
			ЭтаФорма.Элементы.Номер.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.Отображать;
			ЭтаФорма.Элементы.МестоПредоставления.АвтоОтметкаНезаполненного = Истина;
			ЭтаФорма.Элементы.ОписаниеПолномочий.АвтоОтметкаНезаполненного = Истина;
		КонецЕсли; 
		
	Иначе
		
		ЭтаФорма.Элементы.Доверитель.Видимость = Ложь;
		ЭтаФорма.Элементы.МестоПредоставления.Видимость = Ложь;
			
	КонецЕсли; 
	
	ЭтаФорма.Элементы.ВидДоверенности.ТолькоПросмотр = Не ЭтаФорма.ЭтоПолноправныйПользователь;
	
	ЭтаФорма.Элементы.ДатаОтзыва.Видимость = ЭтаФорма.ДоверенностьОтозвана;
	ЭтаФорма.Элементы.ОписаниеПолномочий.Видимость = ЭтаФорма.ИныеПолномочия;
	ЭтаФорма.Элементы.ОписаниеОграничений.Видимость = ЭтаФорма.Ограничения;
	ЭтаФорма.Элементы.ВидыДоговоров.Видимость = ЭтаФорма.ОграниченияПоВидамДоговоров;

	Если ЭтаФорма.НесколькоПоверенных = 1 Тогда
		ЭтаФорма.Элементы.Поверенный.Видимость = Ложь;
		ЭтаФорма.Элементы.СписокПоверенных.Видимость = Истина;
	Иначе
		ЭтаФорма.Элементы.Поверенный.Видимость = Истина;
		ЭтаФорма.Элементы.СписокПоверенных.Видимость = Ложь;
	КонецЕсли; 
	
	ЭтаФорма.Элементы.НесколькоПоверенных.Доступность = Не ЭтаФорма.ТолькоПросмотр;
	
	НастроитьФормуМЧД(ЭтаФорма);
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьФормуМЧД(ЭтаФорма)

	ЭтоВходящаяМЧД = (ЭтаФорма.Объект.ВидДоверенности = ПредопределенноеЗначение("Перечисление.ВидыДоверенностей.Входящая") И ЭтаФорма.ЭтоМЧД);
	
	ЭтаФорма.Элементы.ФормаКомандаПросмотр.Видимость = ЭтоВходящаяМЧД;
	ЭтаФорма.Элементы.ИдентификаторДоверенности.Видимость = ЭтоВходящаяМЧД;
	ЭтаФорма.Элементы.ИнформационнаяСистема.Видимость = ЭтоВходящаяМЧД;
	ЭтаФорма.Элементы.СтатусВРеестреФНС.Видимость = ЭтоВходящаяМЧД;
	ЭтаФорма.Элементы.ДатаПроверкиСтатуса.Видимость = ЭтоВходящаяМЧД;
	ЭтаФорма.Элементы.КомандаПроверитьСтатус.Видимость = ЭтоВходящаяМЧД;
	
	ЭтаФорма.Элементы.Номер.ТолькоПросмотр = ЭтоВходящаяМЧД;
	ЭтаФорма.Элементы.Дата.ТолькоПросмотр = ЭтоВходящаяМЧД;
	ЭтаФорма.Элементы.Доверитель.ТолькоПросмотр = ЭтоВходящаяМЧД;
	ЭтаФорма.Элементы.НесколькоПоверенных.ТолькоПросмотр = ЭтоВходящаяМЧД;
	ЭтаФорма.Элементы.Поверенный.ТолькоПросмотр = ЭтоВходящаяМЧД;
	ЭтаФорма.Элементы.СписокПоверенных.ТолькоПросмотр = ЭтоВходящаяМЧД;
	ЭтаФорма.Элементы.ДатаНачалаДействия.ТолькоПросмотр = ЭтоВходящаяМЧД;
	ЭтаФорма.Элементы.ДатаОкончанияДействия.ТолькоПросмотр = ЭтоВходящаяМЧД;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОткрытьПрисоединенныеФайлы()

	РаботаСФайловымХранилищемКлиент.ОткрытьПрисоединенныеФайлы(Объект.Ссылка);

КонецПроцедуры

&НаСервере
Процедура ПроверитьРеквизитОбъектаПоФлагу(ИмяФлага, ИмяРеквизита, ЗаголовокРеквизита, Отказ)

	Если ЭтаФорма[ИмяФлага] И Не ЗначениеЗаполнено(Объект[ИмяРеквизита]) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле '" + ЗаголовокРеквизита + "' не заполнено", Объект.Ссылка, , "Объект." + ИмяРеквизита, Отказ);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаПросмотр(Команда)
	
	Элементы.ФормаКомандаПросмотр.Пометка = Не Элементы.ФормаКомандаПросмотр.Пометка;
	Элементы.ПредставлениеДокумента.Видимость = Элементы.ФормаКомандаПросмотр.Пометка;
		
	Если Элементы.ФормаКомандаПросмотр.Пометка Тогда
		
		Элементы.ФормаКомандаПросмотр.Заголовок = "Скрыть доверенность";
		
		ПараметрыДоверенности = Новый Структура("Ссылка, ИдентификаторДоверенности");
		ЗаполнитьЗначенияСвойств(ПараметрыДоверенности, Объект);
		Результат = ПолучитьПредставлениеДокумента(ПараметрыДоверенности);
		
		Если ЗначениеЗаполнено(Результат.ТекстОшибки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ТекстОшибки);
			Возврат;
		КонецЕсли;
		
		ЭтаФорма.ПредставлениеДокумента = Результат.ПредставлениеДокумента;
		
	Иначе
		
		Элементы.ФормаКомандаПросмотр.Заголовок = "Показать доверенность";
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПредставлениеДокумента(ПараметрыДоверенности)
	
	Результат = Новый Структура;
	Результат.Вставить("ПредставлениеДокумента", Неопределено);
	Результат.Вставить("ТекстОшибки", "");
	
	ФайлДоверенности = РаботаСМашиночитаемымиДоверенностями.ПолучитьПрисоединенныйФайлМЧД(ПараметрыДоверенности.Ссылка, ПараметрыДоверенности.ИдентификаторДоверенности);
	
	Если ФайлДоверенности = Неопределено Тогда
	
		Результат.ТекстОшибки = "Не удалось найти файл архива МЧД";
		Возврат Результат;
		
	Иначе
		
		КаталогВременныхФайлов = ОбщегоНазначенияКлиентСервер.ПолучитьКаталогВременныхФайлов() + Новый УникальныйИдентификатор + "\";
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ФайлДоверенности.Адрес);
		ЧтениеZip = Новый ЧтениеZipФайла(ДвоичныеДанные.ОткрытьПотокДляЧтения());
		ЧтениеZip.ИзвлечьВсе(КаталогВременныхФайлов);
		ЧтениеZip.Закрыть();
		
		ДанныеДоверенности = Неопределено;
		
		ФайлыАрхива = НайтиФайлы(КаталогВременныхФайлов, ПолучитьМаскуВсеФайлы());
		
		Для каждого ФайлАрхива Из ФайлыАрхива Цикл
			Если НРег(ФайлАрхива.Расширение) = ".xml" Тогда
				ДанныеДоверенности = Новый ДвоичныеДанные(ФайлАрхива.ПолноеИмя);
			КонецЕсли;
		КонецЦикла;
		
		УдалитьФайлы(КаталогВременныхФайлов);
		
	КонецЕсли; 
	
	Если ДанныеДоверенности = Неопределено Тогда
	
		Результат.ТекстОшибки = "Не удалось найти файл МЧД";
		Возврат Результат;
	
	КонецЕсли;
	
	ОбъектXDTOМЧД = РаботаСМашиночитаемымиДоверенностями.ОбъектXDTOМЧД(ДанныеДоверенности);
	Если ЗначениеЗаполнено(ОбъектXDTOМЧД.ТекстОшибки) Тогда
		Результат.ТекстОшибки = ОбъектXDTOМЧД.ТекстОшибки;
		Возврат Результат;
	КонецЕсли;
		
	РезультатФормирования = РаботаСМашиночитаемымиДоверенностями.ТабличныйДокументМЧД(ОбъектXDTOМЧД.ОбъектМЧД);	
	
	Если РезультатФормирования <> Неопределено И РезультатФормирования.Успех Тогда
		Результат.ПредставлениеДокумента = РезультатФормирования.ПредставлениеДокумента;
	Иначе
		Результат.ТекстОшибки = "Не удалось сформировать представление МЧД";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ИнформационнаяСистемаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если СтрНачинаетсяС(НРег(Объект.ИнформационнаяСистема), "http") Тогда
	
		ЗапуститьПриложение(Объект.ИнформационнаяСистема);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроверитьСтатус(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проверка статуса доступна только для записанного документа");
		Возврат;
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ИдентификаторДоверенности) Тогда
	
		ТекущийСтатус = КомандаПроверитьСтатусНаСервере(Объект.Организация, Объект.Ссылка, Объект.ИдентификаторДоверенности);
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ТекущийСтатус);
		Элементы.СтатусВРеестреФНС.ЦветТекста = ТекущийСтатус.Цвет;
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствует идентификатор доверенности в реестре ФНС");
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КомандаПроверитьСтатусНаСервере(Организация, Доверенность, ИдентификаторДоверенности)
	
	ТекущийСтатус = НовыйТекущийСтатус();
	
	Попытка
		Статус = РаботаСМашиночитаемымиДоверенностями.ПолучитьСтатусФНС("", ИдентификаторДоверенности);
	Исключение
		ТекстОшибки = "Не удалось получить статус доверенности в ФНС. Система сообщает:" + Символы.ПС;
		ОписаниеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки + ОписаниеОшибки);
	КонецПопытки;
	
	Если ЗначениеЗаполнено(Статус) Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		Запись = РегистрыСведений.СтатусыМЧД.СоздатьМенеджерЗаписи();
		Запись.Период = ТекущаяДатаСеанса();
		Запись.Организация = Организация;
		Запись.Доверенность = Доверенность;
		Запись.Статус = Перечисления.СтатусыМашиночитаемойДоверенностиВРеестреФНС[Статус];
		
		Попытка
			
			Запись.Записать();
			
			ТекущийСтатус.СтатусВРеестреФНС = Статус;
			ТекущийСтатус.ДатаПроверкиСтатуса = Запись.Период;
			
			Если Статус = "Зарегистрировано" Или Статус = "ДатаНачалаДействияНеНаступила" Тогда
				ТекущийСтатус.Цвет = Новый Цвет;
			КонецЕсли;
			
		Исключение
			
			ТекстОшибки = "Не удалось записать статус доверенности в ФНС. Система сообщает:" + Символы.ПС;
			ОписаниеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки + ОписаниеОшибки);
			
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат ТекущийСтатус;
	
КонецФункции

&НаСервереБезКонтекста
Функция НовыйТекущийСтатус()

	ТекущийСтатус = Новый Структура;
	ТекущийСтатус.Вставить("СтатусВРеестреФНС", "Отсутствует");
	ТекущийСтатус.Вставить("ДатаПроверкиСтатуса", '00010101');
	ТекущийСтатус.Вставить("Цвет", Новый Цвет(225, 0, 0));
	
	Возврат ТекущийСтатус;
	
КонецФункции

&НаКлиенте
Процедура ЭтоМЧДПриИзменении(Элемент)
	
	Если ЭтаФорма.ЭтоМЧД Тогда
	    Объект.ФормаПредоставления = ПредопределенноеЗначение("Перечисление.ФормыПредоставленияДокументов.МЧД");
	Иначе
		Объект.ФормаПредоставления = Неопределено;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Для Каждого Поверенный Из Объект.Поверенные Цикл
		Оповестить("ЗаписьДоверенности", Поверенный); 
	КонецЦикла;	

КонецПроцедуры

#КонецОбласти
